UTAF_Base/requestFiles/PTY_PTS_GetPersonList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://api.web.bc/api/schema/commoncontext/v2" xmlns:v1="http://api.web.bc/api/schema/commoncontext/transaction/v1" xmlns:v11="http://api.web.bc/api/schema/commoncontext/consumertransaction/v1" xmlns:v12="http://api.web.bc/capability/business/b182-01/services/person/flv000568/v1" xmlns:v13="http://api.web.bc/capability/business/b182-01/objects/requestgetpersonlist/flv000568/v1">
   <soapenv:Header>
      <v2:CommonContextRequest>
         <v2:transaction>
            <v1:messageId>${Req_corrId}</v1:messageId>
            <v1:conversationId>${Req_corrId}</v1:conversationId>
            <v1:dateTimeCreated>${Req_date}</v1:dateTimeCreated>
         </v2:transaction>
      </v2:CommonContextRequest>
   </soapenv:Header>
   <soapenv:Body>
      <v12:RequestDataGetPersonList>
         <v12:serviceContext>
            <v12:scoping>
               <v12:functionalScope>
                  <v13:value>${Req_roles}</v13:value>
               </v12:functionalScope>
              <v12:functionalScope>
                  <v13:value>${Req_attributes}</v13:value>
               </v12:functionalScope>
               <v12:functionalScope>
                  <v13:value>${Req_relations}</v13:value>
               </v12:functionalScope>
               <v12:functionalScope>
                  <v13:value>${Req_externalPartyRoles}</v13:value>
               </v12:functionalScope>
            </v12:scoping>
            <v12:transactionData>
               <v12:endUserId>609496301</v12:endUserId>
               <v12:endUserLanguage>EN</v12:endUserLanguage>
               <v12:consumerApplication>${Req_consumerApplication}</v12:consumerApplication>
            </v12:transactionData>
         </v12:serviceContext>
         <v12:serviceData>
            <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_1}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_1}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_1}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_2}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_2}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_2}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_3}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_3}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_3}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_4}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_4}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_4}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_5}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_5}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_5}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_6}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_6}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_6}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_7}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_7}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_7}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_8}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_8}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_8}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_9}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_9}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_9}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_10}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_10}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_10}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_11}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_11}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_11}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_12}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_12}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_12}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_13}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_13}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_13}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_14}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_14}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_14}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_15}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_15}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_15}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_16}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_16}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_16}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_17}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_17}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_17}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_18}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_18}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_18}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_19}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_19}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_19}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
              <v12:personIdentifier>
               <v13:id>${Req_personIdentifierId_20}</v13:id>
               <v13:idScope>
                  <v13:value>${Req_personIdentifierIdScope_20}</v13:value>
               </v13:idScope>
               <v13:idContext>
                  <v13:value>${Req_personIdentifierIdContext_20}</v13:value>
               </v13:idContext>
            </v12:personIdentifier>
         </v12:serviceData>
      </v12:RequestDataGetPersonList>
   </soapenv:Body>
</soapenv:Envelope>